cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/services"
brew "awscli"
brew "curl"
brew "php"
brew "composer"
brew "gh"
brew "git-secrets"
brew "go"
brew "jq"
brew "mysql"
brew "node"
brew "node-build"
brew "nodenv"
brew "pre-commit"
brew "pyenv"
brew "tfenv"
brew "tmux"
brew "tree"
brew "virtualenv"

cask "warp"
cask "cursor"
cask "discord"
cask "raycast"
cask "linear-linear"
cask "1password"
cask "arc"
cask "slack"
cask "logi-options+"
cask "notion-calendar"
cask "gather"
cask "jetbrains-toolbox"
cask "zoom"
cask "google-chrome"
cask "chatgpt"
cask "rectangle"
cask "cmd-eikana"

vscode "antfu.slidev"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
